code/Transbank/Webpay/logs/webpay-2017-07-06.txt

16:40:52 - datos request initTransaction 
Array
(
    [wSTransactionType] => TR_MALL_WS
    [commerceId] => 597020000542
    [buyOrder] => 000000159
    [sessionId] => 
    [returnURL] => http://sm-dev.xpectrumtech.com/webpay/payment/response
    [finalURL] => http://sm-dev.xpectrumtech.com/webpay/payment/success
    [transactionDetails] => Array
        (
            [commerceCode] => 597020000543
            [buyOrder] => 000000159
            [amount] => 7992
        )

)

16:40:54 - initTransaction request  - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-806338"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-806337"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>l+iKmv3NBh/oFSncvHReMouiPsI=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>Qyow72gXnypUOrmKmbqbPi5wi54ud18sTiRZ72OynDz/5yWu6DbsfQklBYfRHGqIT2N+/0Xx9woP
5ecUOzI/VzWZPXZv6gZK57Wt696+KsqJa7eUHNV+v7U9LWPUpCThppHUTGlOWe+ZGLooYZnaN8pS
7lpvc+DjAseRw7aSLR/vwFdcOcnafDCc/E75XVjHLDvVQdfpLrYBlOKiEGs5cQ11g21CUBlUnFZ4
RCx0aeOGo7D86o4B/h6OdSPHuZ7QFWndAss72Zed4bdQ7JZf/KURKrmViAcXax/5Mw6gg7Mo9v9j
prjVRCwUHd0KugpJUrZg/djKVHVbhUcYAhnilQ==</ds:SignatureValue><ds:KeyInfo Id="KI-530FDA96CA8136399814993592537871209704"><wsse:SecurityTokenReference wsu:Id="STR-530FDA96CA8136399814993592537871209705"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-806337"><ns2:initTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><token>e0eabe07cfc54d4cd9a3716ad9fdaaeaa128edf8a533689fccb66ea119569dff</token><url>https://webpay3gint.transbank.cl/filtroUnificado/initTransaction</url></return></ns2:initTransactionResponse></soap:Body></soap:Envelope>

16:40:54 - initTransaction response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-806338"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-806337"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>l+iKmv3NBh/oFSncvHReMouiPsI=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>Qyow72gXnypUOrmKmbqbPi5wi54ud18sTiRZ72OynDz/5yWu6DbsfQklBYfRHGqIT2N+/0Xx9woP
5ecUOzI/VzWZPXZv6gZK57Wt696+KsqJa7eUHNV+v7U9LWPUpCThppHUTGlOWe+ZGLooYZnaN8pS
7lpvc+DjAseRw7aSLR/vwFdcOcnafDCc/E75XVjHLDvVQdfpLrYBlOKiEGs5cQ11g21CUBlUnFZ4
RCx0aeOGo7D86o4B/h6OdSPHuZ7QFWndAss72Zed4bdQ7JZf/KURKrmViAcXax/5Mw6gg7Mo9v9j
prjVRCwUHd0KugpJUrZg/djKVHVbhUcYAhnilQ==</ds:SignatureValue><ds:KeyInfo Id="KI-530FDA96CA8136399814993592537871209704"><wsse:SecurityTokenReference wsu:Id="STR-530FDA96CA8136399814993592537871209705"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-806337"><ns2:initTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><token>e0eabe07cfc54d4cd9a3716ad9fdaaeaa128edf8a533689fccb66ea119569dff</token><url>https://webpay3gint.transbank.cl/filtroUnificado/initTransaction</url></return></ns2:initTransactionResponse></soap:Body></soap:Envelope>

16:43:09 - transactionResult request  - <?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://service.wswebpay.webpay.transbank.com/"><SOAP-ENV:Body><ns1:getTransactionResult><tokenInput>e0eabe07cfc54d4cd9a3716ad9fdaaeaa128edf8a533689fccb66ea119569dff</tokenInput></ns1:getTransactionResult></SOAP-ENV:Body></SOAP-ENV:Envelope>

16:43:09 - transactionResult response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-806366"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-806365"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>TI8cmx2pVcEDPTVLKYiOuO/617o=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>bBE/2ac4wSNVXYoNGM5Q+dKGuUb7AcQq3liH1Hj++XH9JxPQ0GG0ILn6wfEjfSisbjbG/KdmYXt+
OpLDIl4B8PXvLfGqYzQkZYWcztBFsL0BCzkfNWoje9jZZ2W9f7aUFZBA0QBB+d6rqX1tIJd5Nj0G
ZX6m3dVjvy0TUGAbtk3WX2y+hn6eh5DTtZLjcb3FMWCukX3nxNqy1PcksNBU7EBAqcgQsys98WRC
fZ6gaQOMr3iXXm2SqPIBaNuvRyKze5SVqG12Jg7HeY6cMp6LMTMXl2OrovN6eAbmtzevzrOcxeir
70rMMeySjeTaWLBmjKPHvNLfTbXzh0ViAVPynw==</ds:SignatureValue><ds:KeyInfo Id="KI-530FDA96CA8136399814993593893571209746"><wsse:SecurityTokenReference wsu:Id="STR-530FDA96CA8136399814993593893571209747"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-806365"><ns2:getTransactionResultResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><accountingDate>0706</accountingDate><buyOrder>000000159</buyOrder><cardDetail><cardNumber>6623</cardNumber></cardDetail><detailOutput><sharesNumber>0</sharesNumber><amount>7992</amount><commerceCode>597020000543</commerceCode><buyOrder>000000159</buyOrder><authorizationCode>1213</authorizationCode><paymentTypeCode>VD</paymentTypeCode><responseCode>0</responseCode></detailOutput><transactionDate>2017-07-06T12:40:53.526-04:00</transactionDate><urlRedirection>https://webpay3gint.transbank.cl/filtroUnificado/voucher.cgi</urlRedirection><VCI>TSY</VCI></return></ns2:getTransactionResultResponse></soap:Body></soap:Envelope>

16:43:10 - acknowledgeTransaction request  - <?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://service.wswebpay.webpay.transbank.com/"><SOAP-ENV:Body><ns1:acknowledgeTransaction><tokenInput>e0eabe07cfc54d4cd9a3716ad9fdaaeaa128edf8a533689fccb66ea119569dff</tokenInput></ns1:acknowledgeTransaction></SOAP-ENV:Body></SOAP-ENV:Envelope>

16:43:10 - acknowledgeTransaction response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-806368"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-806367"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>giL/IXPX6dYP3FtIVwKu3lxwLlk=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>Swhqg90jz2LdTK5LwzIFJy7mrDetnYmN/+1L6fqMo/MybSZeHox2+UTkK558hSfVMx1AKYx+Ui68
5mMhmM1xEkzFP9imkrOmGIeA9+NvsxMd+qOweZH5iOUPekz+0zoNMnSkI8BehpVSlvpduIx/Lns7
hbN4Wzhz8FkeQEZUc0H3PhU4os7PK93pwD7hA8SpAOMTZ28RabS997o1leJm5yAecYoKRB9e8xS8
bf/AkNk9gKoOy0LSm+MveFnbQ4cBg2mJSYEORPZVjdp/tEtvj6XhujpO8y7G0TAA7d/mPgVSutEE
AzaQOsBPoqLAjnhFpqc6lRiWbJsqEFKiuOCfiA==</ds:SignatureValue><ds:KeyInfo Id="KI-530FDA96CA8136399814993593902711209749"><wsse:SecurityTokenReference wsu:Id="STR-530FDA96CA8136399814993593902711209750"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-806367"><ns2:acknowledgeTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"/></soap:Body></soap:Envelope>

